<template>
  <div class="bootstrap-scope">
    <div class="terms-conditions-area ptb-80">
      <div class="container">
        <div class="terms-conditions-content">
          <h1>Політика Конфіденційності сервісу Estimate Real Estate</h1>
          <h2>1. Загальні положення</h2>
          <p>
            Ця Політика Конфіденційності встановлює порядок обробки та захисту інформації про осіб,
            які використовують сервіс онлайн оцінювання нерухомості Estimate Real Estate (далі -
            Клієнти).
          </p>

          <h2>2. Особисті дані, які ми обробляємо</h2>
          <p>
            2.1. Ми можемо збирати наступні дані: ПІБ, контактні дані (телефон, електронна пошта),
            адреса нерухомості, інформація про використання послуг, інформація про нерухомість та
            інші дані, які Клієнт надає добровільно.
          </p>

          <h2>3. Мета обробки особистих даних</h2>
          <p>
            3.1. Ми обробляємо особисті дані Клієнта з метою надання йому послуг з оцінки
            нерухомості, для аналізу і вдосконалення наших послуг, а також для комунікації з
            Клієнтом.
          </p>

          <h2>4. Заходи щодо захисту особистих даних</h2>
          <p>
            4.1. Ми вживаємо всіх необхідних організаційних і технічних заходів для захисту
            особистих даних від незаконної або випадкової дії, втрати, знищення, пошкодження,
            несанкціонованого розголошення або доступу.
          </p>
          <p>
            4.2. Ми зобов'язуємося не передавати особисті дані Клієнта, а також введені Клієнтом
            дані про нерухомість в процесі користування сервісом третім особам без його вираженого
            дозволу, крім випадків, передбачених законодавством.
          </p>

          <h2>5. Згода на обробку персональних даних</h2>
          <p>
            5.1. Користування сервісом Estimate Real Estate автоматично означає згоду Клієнта на
            обробку його персональних даних відповідно до цієї Політики Конфіденційності.
          </p>

          <h2>6. Права клієнтів</h2>
          <p>
            6.1. Клієнт має право отримати інформацію про обробку його особистих даних, а також має
            право виправляти, видаляти, обмежувати обробку або заперечувати проти обробки його
            особистих даних.
          </p>

          <h2>7. Зміни в політиці конфіденційності</h2>
          <p>
            7.1. Ми залишаємо за собою право вносити зміни в цю Політику Конфіденційності. Всі зміни
            будуть опубліковані на нашому сайті.
          </p>
          <p>
            Якщо у вас є будь-які питання щодо цієї політики конфіденційності, будь ласка,
            зв'яжіться з нами за адресою support@estimate.realestate або за через онлайн-чат з нашим
            консультантом : <a href="javascript:void(0)">написати</a>.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { defineComponent } from 'vue';
import { ref } from 'vue';
import { useMeta, useQuasar } from 'quasar';
import { useTemplateGlobals } from 'stores/template-globals';

export default defineComponent({
  name: 'PrivacyPolicy',
  setup() {
    const metaData = {
      title: 'Політика конфіденційності - Estimate Real Estate',
      meta: {
        description: {
          name: 'description',
          content: 'Політика конфіденційності',
        },
        keywords: {
          name: 'keywords',
          content: 'Політика конфіденційності',
        },
        robots: { name: 'robots', content: 'noindex, nofollow' },
      },
    };
    useMeta(metaData);
  },
});
</script>
