<template>
  <div class="bootstrap-scope">
    <div class="terms-conditions-area ptb-80">
      <div class="container">
        <div class="terms-conditions-content">
          <h1>Договір-оферта</h1>
          <h2>1. Терміни та визначення</h2>
          <p>
            1.1. <b>Виконавець</b> - онлайн-сервіс Estimate Real Estate, який надає послуги з онлайн
            оцінювання вартості нерухомості через сайт https://estimate.realestate.
          </p>
          <p>
            1.2. <b>Замовник</b> - фізична або юридична особа, яка замовляє та оплачує послуги
            Виконавця.
          </p>
          <p>
            1.3. <b>Послуги</b> - послуги з онлайн оцінювання вартості нерухомості, що надаються
            Замовникам за допомогою веб-сайту Виконавця.
          </p>
          <p>
            1.4. <b>Оферта</b> - цей публічний договір-оферта, що містить всі суттєві умови надання
            послуг та розміщений на веб-сайті Виконавця.
          </p>

          <h2>2. Загальні положення</h2>
          <p>
            2.1. Цей договір вважається публічною пропозицією (офертою) Виконавця, надати Послуги
            Замовнику на умовах, викладених в цьому договорі.
          </p>
          <p>
            2.2. Оплата та користування Послугами Виконавця означає прийняття Замовником умов цього
            договору в повному обсязі без будь-яких зауважень та винятків.
          </p>

          <h2>3. Предмет договору</h2>
          <p>
            3.1. Виконавець зобов'язується надати Замовнику Послуги з онлайн оцінювання вартості
            нерухомості згідно з умовами цього договору, а Замовник зобов'язується оплатити Послуги
            відповідно до встановлених тарифів.
          </p>

          <h2>4. Права та обов'язки сторін</h2>
          <p>4.1. Виконавець має право:</p>
          <p>4.1.1. Вносити зміни до умов цього договору.</p>
          <p>
            4.1.2. Тимчасово призупиняти надання Послуг у разі проведення технічних робіт на
            веб-сайті, проінформувавши про це Замовника на сайті.
          </p>
          <p>4.2. Виконавець зобов'язується:</p>
          <p>
            4.2.1. Надати Замовнику Послуги з онлайн оцінювання вартості нерухомості, використовуючи
            математичні формули та алгоритми штучного інтелекту.
          </p>
          <p>
            4.2.2. Забезпечити зберігання та конфіденційність персональних даних Замовника та даних
            нерухомості, введених Замовником на сайті.
          </p>

          <p>4.3. Замовник має право:</p>
          <p>4.3.1. Користуватися Послугами Виконавця відповідно до умов цього договору.</p>
          <p>
            4.3.2. Звертатися до служби підтримки Виконавця з питаннями та претензіями щодо наданих
            Послуг через онлайн-чат підтримки або електронну пошту.
          </p>
          <p>4.4. Замовник зобов'язується:</p>
          <p>
            4.4.1. Оплатити Послуги Виконавця відповідно до встановлених
            <router-link :to="{ name: 'price' }">тарифів</router-link>.
          </p>
          <p>4.4.2. Не передавати свій аккаунт та доступ до Послуг третім особам.</p>
          <p>
            4.4.3. Відповідати за достовірність та актуальність введених даних про нерухомість для
            оцінки.
          </p>

          <h2>5. Відповідальність сторін</h2>
          <p>
            5.1. Виконавець не несе відповідальності за кінцевий результат оцінки вартості
            нерухомості, оскільки результати розраховуються на основі математичних формул та
            алгоритмів штучного інтелекту.
          </p>
          <p>
            5.2. Кінцевий результат оцінки вартості нерухомості не може бути оскаржений Замовником.
          </p>
          <p>
            5.3. Повернення коштів за оцінку нерухомості може бути здійснено виключно шляхом
            перемовин через онлайн-чат підтримки або електронну пошту.
          </p>
          <p>
            5.4. Повернення коштів не гарантовано, якщо Виконавець не згоден з аргументами претензії
            Замовника.
          </p>

          <h2>6. Захист персональних даних</h2>
          <p>
            6.1. Виконавець зобов'язується забезпечити конфіденційність персональних даних Замовника
            та даних нерухомості, введених Замовником на сайті, та не передавати їх третім особам
            без згоди Замовника.
          </p>

          <h2>7. Вирішення спорів</h2>
          <p>
            7.1. Усі спори та розбіжності, що виникають між сторонами за цим договором, будуть
            вирішуватись шляхом переговорів.
          </p>
          <h2>8. Форс-мажорні обставини</h2>
          <p>
            8.1. Сторони звільняються від відповідальності за невиконання або неналежне виконання
            зобов'язань за цим договором, якщо це стало результатом форс-мажорних обставин (стихійні
            лиха, збройні конфлікти, терористичні акти, відключення електроенергії та інші
            обставини, які сторони не могли передбачити та запобігти).
          </p>

          <h2>9. Інші умови</h2>
          <p>
            9.1. Цей договір набуває чинності з моменту оплати Послуг Замовником та діє до виконання
            сторонами своїх зобов'язань.
          </p>
          <p>
            9.2. Цей договір складено українською мовою та має однакову юридичну силу для обох
            сторін.
          </p>
          <p>9.3. Цей договір регулюється та тлумачиться відповідно до законодавства України.</p>
          <p>
            9.4. Всі попередні угоди, листування та пропозиції між сторонами відносно предмета цього
            договору вважаються недійсними після набуття чинності цим договором.
          </p>
          <p>
            9.5. У випадку визнання будь-якого положення цього договору недійсним, таке положення
            вважається відокремленим від інших положень, і недійсність такого положення не впливає
            на дійсність або виконання інших положень договору.
          </p>

          <h2>10. Згода на обробку персональних даних</h2>
          <p>
            10.1. Замовник, використовуючи сайт та здійснюючи оплату Послуг, підтверджує свою згоду
            на обробку своїх персональних даних, наданих Виконавцю, з метою виконання зобов'язань за
            цим договором, відповідно до вимог Закону України "Про захист персональних даних".
          </p>
          <p>
            10.2. Виконавець зобов'язується обробляти персональні дані Замовника відповідно до
            законодавства України та вживати необхідних та достатніх організаційних та технічних
            заходів для захисту персональних даних від неправомірного доступу, знищення, зміни,
            блокування, копіювання, поширення персональних даних, а також від інших неправомірних
            дій стосовно таких даних.
          </p>
          <p>
            10.3. Виконавець має право передавати персональні дані Замовника третім особам тільки з
            попередньою згодою Замовника, або якщо передача таких даних є вимогою законодавства
            України.
            <router-link :to="{ name: 'privacy-policy' }">Політика конфіденційності</router-link>.
          </p>

          <h2>11. Використання Cookie</h2>
          <p>
            11.1. Cookie – це невеликі текстові файли, які зберігаються на пристроях користувачів
            під час перегляду веб-сайтів. Вони допомагають сайтам запам'ятовувати інформацію про
            користувача та його налаштування, що поліпшує зручність користування сайтом та підвищує
            його ефективність.
          </p>
          <p>
            11.2. Використання Cookie на цьому сайті спрямоване на оптимізацію роботи сайту та
            надання користувачеві персоналізованої інформації. Вони можуть використовуватися для
            зберігання налаштувань користувача, аналізу трафіку сайту, забезпечення безпеки
            користувача та інших цілей, які відповідають законодавству України.
          </p>
          <p>
            11.3. Більшість браузерів автоматично приймає Cookie, але користувач може налаштувати
            свій браузер, щоб відхилити Cookie або попереджати про їх встановлення. Однак,
            відключення Cookie може призвести до обмеження функціоналу сайту та його послуг.
          </p>
          <p>
            11.4. Згода на використання файлів Cookie є необхідною для користування сайтом та його
            функціоналом. Без згоди на використання файлів Cookie робота сайту може бути обмежена
            або неможлива.
          </p>

          <h2>12. Надсилання результатів оцінки</h2>
          <p>
            12.1. Виконавець відправляє результати оцінки на електронну скриньку Замовника, вказану
            при реєстрації на сайті або при оформленні замовлення на оцінку.
          </p>
          <p>
            12.2. Виконавець не несе відповідальності за невірно вказану електронну адресу Замовника
            або за технічні проблеми доставки електронного листа Замовнику, які не входять в
            компетенцію Виконавця.
          </p>
          <p>
            12.3. Результати оцінки також доступні для Замовника в
            <router-link :to="{ name: 'personal' }">особистому кабінеті</router-link>, доступ до
            якого забезпечується виключно за допомогою робочої електронної адреси Замовника.
          </p>
          <p>
            12.4. У разі втрати Замовником доступу до електронної скриньки, на яку був
            зареєстрований акаунт або у разі введення помилкової електронної адреси, доступ до
            особистого кабінету не може бути відновлений у разі втрати паролю, а також не можуть
            бути отримані на електронну пошту результати оцінки.
          </p>
          <p>
            12.5. Рекомендуємо підтвердити свою електронну адресу в особистому кабінеті після
            реєстрації на сайті або при оформленні замовлення, щоб забезпечити корректне надання
            послуг та гарантовано отримати результати оцінки.
          </p>

          <h2>13. Оплата послуг</h2>
          <p>
            13.1. Оплата за послуги, надані Виконавцем, здійснюється виключно через систему платежів
            <a href="https://www.portmone.com.ua/" target="_blank">Portmone</a>. Виконавець не
            пропонує жодних інших способів оплати за свої послуги.
          </p>

          <h2>14. Контакти</h2>
          <p>E-mail: support@estimate.realestate</p>
          <p>
            Онлайн-чат з нашим консультантом:
            <a href="javascript:void(0)">написати</a>
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { defineComponent } from 'vue';
import { useMeta } from 'quasar';

export default defineComponent({
  name: 'TermsAndConditions',
  setup() {
    const metaData = {
      title: 'Публічна оферта, умови користування сервісом - Estimate Real Estate',
      meta: {
        description: {
          name: 'description',
          content: 'Публічна оферта — умови користування сервісом',
        },
        keywords: {
          name: 'keywords',
          content: 'Публічна оферта — умови користування сервісом',
        },
        robots: { name: 'robots', content: 'noindex, nofollow' },
      },
    };
    useMeta(metaData);
  },
});
</script>
